
# Минимальное и максимальное количество баллов ЕГЭ:
MIN_POINTS = 0
MAX_POINTS = 310

# Минимальное и максимальное количество дополнительных баллов:
MIN_BONUS_POINTS = 0
MAX_BONUS_POINTS = 10

# Минимальное и максимальное значение среднего балла аттестата:
MIN_GPA = 3
MAX_GPA = 5

# Минимальное и максимальное количество баллов ЕГЭ за один предмет:
MIN_EXAM_POINTS = 0
MAX_EXAM_POINTS = 100

# Минимальное и максимальное значение приоритета:
MIN_PRIORITY = 1
MAX_PRIORITY = 5

# Возможные экзамены ЕГЭ:
AVAILABLE_EXAM_NAMES = [
    "Русский язык",
    "Математика",
    "Информатика",
    "Физика",
    "Обществознание",
    "Химия",
    "История"
]

# Количество бюджетных мест на направления подготовки:
BUDGET_PLACES_FOR_DIRECTIONS = {
    "": ...
}

PREDICTED_YEAR = 2024
